; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-5-6-7-9)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4
    shape0 shape1 shape2 shape3 shape4 shape5
    key0 key1 key2 key3 key4 key5 key6
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (shape shape3)
       (shape shape4)
       (shape shape5)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)
       (key key6)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-3)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (locked pos1-4)
       (locked pos2-3)
       (locked pos1-2)
       (locked pos2-1)
       (locked pos1-1)
       (locked pos0-0)
       (locked pos1-3)
       (locked pos0-3)
       (locked pos1-0)
       (lock-shape  pos1-4 shape0)
       (lock-shape  pos2-3 shape1)
       (lock-shape  pos1-2 shape2)
       (lock-shape  pos2-1 shape3)
       (lock-shape  pos1-1 shape4)
       (lock-shape  pos0-0 shape5)
       (lock-shape  pos1-3 shape2)
       (lock-shape  pos0-3 shape4)
       (lock-shape  pos1-0 shape4)
       (open pos0-1)
       (open pos0-2)
       (open pos0-4)
       (open pos2-0)
       (open pos2-2)
       (open pos2-4)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape3)
       (key-shape  key4 shape4)
       (key-shape  key5 shape5)
       (key-shape  key6 shape3)
       (at key0 pos0-4)
       (at key1 pos0-0)
       (at key2 pos2-4)
       (at key3 pos0-2)
       (at key4 pos2-4)
       (at key5 pos0-3)
       (at key6 pos0-0)
       (at-robot pos0-4)
    )

    (:goal (and
       (at key2 pos0-1)
       (at key5 pos2-3)
       (at key6 pos1-2)
    )))

; plan
1. (pickup pos0-4 key0)
   deleted: (at key0 pos0-4) (arm-empty)
   added: (holding key0)
   goals met: 0 of 3
2. (unlock pos0-4 pos1-4 key0 shape0)
   deleted: (locked pos1-4)
   added: (open pos1-4)
   goals met: 0 of 3
3. (move pos0-4 pos1-4)
   deleted: (at-robot pos0-4)
   added: (at-robot pos1-4)
   goals met: 0 of 3
4. (move pos1-4 pos2-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos2-4)
   goals met: 0 of 3
5. (pickup-and-loose pos2-4 key4 key0)
   deleted: (holding key0) (at key4 pos2-4)
   added: (holding key4) (at key0 pos2-4)
   goals met: 0 of 3
6. (move pos2-4 pos1-4)
   deleted: (at-robot pos2-4)
   added: (at-robot pos1-4)
   goals met: 0 of 3
7. (move pos1-4 pos0-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos0-4)
   goals met: 0 of 3
8. (unlock pos0-4 pos0-3 key4 shape4)
   deleted: (locked pos0-3)
   added: (open pos0-3)
   goals met: 0 of 3
9. (move pos0-4 pos0-3)
   deleted: (at-robot pos0-4)
   added: (at-robot pos0-3)
   goals met: 0 of 3
10. (pickup-and-loose pos0-3 key5 key4)
   deleted: (holding key4) (at key5 pos0-3)
   added: (holding key5) (at key4 pos0-3)
   goals met: 0 of 3
11. (move pos0-3 pos0-2)
   deleted: (at-robot pos0-3)
   added: (at-robot pos0-2)
   goals met: 0 of 3
12. (move pos0-2 pos0-1)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-1)
   goals met: 0 of 3
13. (unlock pos0-1 pos0-0 key5 shape5)
   deleted: (locked pos0-0)
   added: (open pos0-0)
   goals met: 0 of 3
14. (putdown pos0-1 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos0-1)
   goals met: 0 of 3
15. (move pos0-1 pos0-0)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-0)
   goals met: 0 of 3
16. (pickup pos0-0 key1)
   deleted: (at key1 pos0-0) (arm-empty)
   added: (holding key1)
   goals met: 0 of 3
17. (move pos0-0 pos0-1)
   deleted: (at-robot pos0-0)
   added: (at-robot pos0-1)
   goals met: 0 of 3
18. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 0 of 3
19. (move pos0-2 pos0-3)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-3)
   goals met: 0 of 3
20. (move pos0-3 pos0-4)
   deleted: (at-robot pos0-3)
   added: (at-robot pos0-4)
   goals met: 0 of 3
21. (move pos0-4 pos1-4)
   deleted: (at-robot pos0-4)
   added: (at-robot pos1-4)
   goals met: 0 of 3
22. (move pos1-4 pos2-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos2-4)
   goals met: 0 of 3
23. (unlock pos2-4 pos2-3 key1 shape1)
   deleted: (locked pos2-3)
   added: (open pos2-3)
   goals met: 0 of 3
24. (pickup-and-loose pos2-4 key2 key1)
   deleted: (holding key1) (at key2 pos2-4)
   added: (holding key2) (at key1 pos2-4)
   goals met: 0 of 3
25. (move pos2-4 pos2-3)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-3)
   goals met: 0 of 3
26. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 0 of 3
27. (unlock pos2-2 pos1-2 key2 shape2)
   deleted: (locked pos1-2)
   added: (open pos1-2)
   goals met: 0 of 3
28. (move pos2-2 pos1-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos1-2)
   goals met: 0 of 3
29. (putdown pos1-2 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos1-2)
   goals met: 0 of 3
30. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 0 of 3
31. (move pos0-2 pos0-1)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-1)
   goals met: 0 of 3
32. (move pos0-1 pos0-0)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-0)
   goals met: 0 of 3
33. (pickup pos0-0 key6)
   deleted: (at key6 pos0-0) (arm-empty)
   added: (holding key6)
   goals met: 0 of 3
34. (move pos0-0 pos0-1)
   deleted: (at-robot pos0-0)
   added: (at-robot pos0-1)
   goals met: 0 of 3
35. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 0 of 3
36. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 0 of 3
37. (pickup-and-loose pos1-2 key2 key6)
   deleted: (holding key6) (at key2 pos1-2)
   added: (holding key2) (at key6 pos1-2)
   goals met: 1 of 3
38. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 1 of 3
39. (move pos0-2 pos0-1)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-1)
   goals met: 1 of 3
40. (pickup-and-loose pos0-1 key5 key2)
   deleted: (holding key2) (at key5 pos0-1)
   added: (holding key5) (at key2 pos0-1)
   goals met: 2 of 3
41. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 2 of 3
42. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 2 of 3
43. (move pos1-2 pos2-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos2-2)
   goals met: 2 of 3
44. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 2 of 3
45. (putdown pos2-3 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos2-3)
   goals met: 3 of 3
